// lib/pages/taiwan_city_data.dart
const Map<String, List<String>> taiwanCityData = {
  "台北市": [
    "中正區", "大同區", "中山區", "松山區", "大安區", "萬華區",
    "信義區", "士林區", "北投區", "內湖區", "南港區", "文山區"
  ],
  "新北市": [
    "板橋區", "三重區", "中和區", "永和區", "新莊區", "新店區",
    "土城區", "蘆洲區", "汐止區", "樹林區", "淡水區", "五股區"
  ],
  "桃園市": ["桃園區", "中壢區", "八德區", "蘆竹區", "平鎮區"],
  "台中市": ["中區", "西區", "北區", "南區", "東區", "西屯區", "北屯區", "南屯區"],
  "台南市": ["中西區", "東區", "南區", "北區", "安平區", "安南區"],
  "高雄市": ["苓雅區", "前鎮區", "三民區", "新興區", "鼓山區", "左營區", "小港區"],
};
